Nl.Aet.Cid.Sdk.Rest.Test,Terminal/Token2_A.xml

<soap:Envelope  xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Header xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><wsse:Security soap:actor="http://www.aortarelease.nl/actor/zim" soap:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><saml:Assertion ID="id-dd1c1f96-f0b0-4026-a978-4d724c0a0a4f" IssueInstant="{IssueInstant}" Version="2.0" xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion"><saml:Issuer Format="urn:oasis:names:tc:SAML:2.0:nameid-format:entity">urn:IIroot:2.16.528.1.1007.3.3:IIext:90000382</saml:Issuer><saml:Subject><saml:NameID Format="urn:oasis:names:tc:SAML:2.0:nameid-format:entity">{UziNumber}:{RoleCode}</saml:NameID><saml:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:holder-of-key"><saml:SubjectConfirmationData><KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#"><X509Data><X509IssuerSerial><X509IssuerName>{X509IssuerName}</X509IssuerName><X509SerialNumber>{X509SerialNumber}</X509SerialNumber></X509IssuerSerial></X509Data></KeyInfo></saml:SubjectConfirmationData></saml:SubjectConfirmation></saml:Subject><saml:Conditions NotBefore="{NotBefore}" NotOnOrAfter="{NotAfter}"><saml:AudienceRestriction><saml:Audience>urn:IIroot:2.16.840.1.113883.2.4.6.6:IIext:1</saml:Audience></saml:AudienceRestriction></saml:Conditions><saml:AuthnStatement AuthnInstant="{AuthnInstant}"><saml:AuthnContext><saml:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:SmartcardPKI</saml:AuthnContextClassRef></saml:AuthnContext></saml:AuthnStatement><saml:AttributeStatement><saml:Attribute Name="autorisatieregel/context" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:unspecified"><saml:AttributeValue>https://goedbeheerdziekenhuis/autorisatieregels/medicatiecontext/v2</saml:AttributeValue></saml:Attribute><saml:Attribute Name="interactionId" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:unspecified"><saml:AttributeValue>GQZG_IN000001NL</saml:AttributeValue></saml:Attribute><saml:Attribute Name="messageIdRoot" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:unspecified"><saml:AttributeValue>2.16.528.1.1007.3.3.90326.1</saml:AttributeValue></saml:Attribute><saml:Attribute Name="messageIdExt" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:unspecified"><saml:AttributeValue>90326-2</saml:AttributeValue></saml:Attribute><saml:Attribute Name="burgerServiceNummer" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:unspecified"><saml:AttributeValue>999911466</saml:AttributeValue></saml:Attribute><saml:Attribute Name="applicationID" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:unspecified"><saml:AttributeValue>urn:IIroot:2.16.840.1.113883.2.4.6.6:IIext:90000326</saml:AttributeValue></saml:Attribute><saml:Attribute Name="contextCodeSystem" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:unspecified"><saml:AttributeValue>2.16.840.1.113883.2.4.3.111.15.1</saml:AttributeValue></saml:Attribute><saml:Attribute Name="contextCode" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:unspecified"><saml:AttributeValue>KZDI</saml:AttributeValue></saml:Attribute></saml:AttributeStatement></saml:Assertion></wsse:Security></soap:Header><soap:Body><GQZG_IN000001NL xmlns="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="urn:hl7-org:v3 file:/C:/Publicaties/1.0.2/schemas_codeGen_flat/GQZG_IN000001NL.xsd"><id extension="90326-2" root="2.16.528.1.1007.3.3.90326.1" /><creationTime value="{CreationTime}" /><versionCode code="NICTIZEd2005-Okt" /><interactionId extension="GQZG_IN000001NL" root="2.16.840.1.113883.1.6" /><profileId extension="810" root="2.16.840.1.113883.2.4.3.11.1" /><processingCode code="P" /><processingModeCode code="T" /><acceptAckCode code="NE" /><receiver><device classCode="DEV" determinerCode="INSTANCE"><id extension="1" root="2.16.840.1.113883.2.4.6.6" /></device></receiver><sender><device classCode="DEV" determinerCode="INSTANCE"><id extension="90000326" root="2.16.840.1.113883.2.4.6.6" /></device></sender><ControlActProcess moodCode="EVN"><authorOrPerformer typeCode="AUT"><participant><AssignedPerson><id extension="{UziNumber}" root="2.16.528.1.1007.3.1" /><code code="{RoleCode}" codeSystem="2.16.840.1.113883.2.4.15.111" displayName="{Role}" /><assignedPrincipalChoiceList><assignedPerson><name>{PassholderName}</name></assignedPerson></assignedPrincipalChoiceList><Organization><id extension="90000382" root="2.16.528.1.1007.3.3" /><code code="Z3" codeSystem="2.16.840.1.113883.2.4.15.1060" displayName="Huisartspraktijk (zelfstandig of groepspraktijk)" /><name>Gezondheidscentrum Aesculaap</name></Organization></AssignedPerson></participant></authorOrPerformer><overseer typeCode="RESP"><assignedEntity><id extension="{UziNumber}" root="2.16.528.1.1007.3.1" /><code code="{RoleCode}" codeSystem="2.16.840.1.113883.2.4.15.111" displayName="{Role}" /><assignedPrincipalChoiceList><assignedPerson><name>{Role}</name></assignedPerson></assignedPrincipalChoiceList><Organization><id extension="90000382" root="2.16.528.1.1007.3.3" /><name>AET</name><addr><city>Arnhem</city></addr></Organization></assignedEntity></overseer><queryByParameter><templateId root="2.16.840.1.113883.2.4.3.11.60.66.10.3" /><queryId extension="QueryId_201900507100300-90326-4" root="2.16.528.1.1007.3.3.90326.1" /><statusCode code="executing" /><responseModalityCode code="B" /><responsePriorityCode code="I" /><executionAndDeliveryTime value="{executionAndDeliveryTime}" /><patientId><value extension="999911466" root="2.16.840.1.113883.2.4.6.3" /></patientId><contextCode><value code="KZDI" codeSystem="2.16.840.1.113883.2.4.3.111.15.1" /></contextCode></queryByParameter></ControlActProcess></GQZG_IN000001NL></soap:Body></soap:Envelope>